package org.example;

/** Написать класс Юзер, у которого 4 свойства: дата регистрации, логин, пароль и id.
 Написать класс UserService
 Со списком пользователей и
 С методами:
 - добавить пользователя в список +
 - удалить пользователя из списка +
 - вывести всех пользователей, баланс которых выше 1000 +
 - метод, который возвращает пользователя по id +
 - метод, который принимает список пользователей и удаляет их
 *
 */


public class Main {
    public static void main(String[] args) {
    UserService userService = new UserService();
    userService.Menu();

    }
}
